k6/results/rest/rest-results/run-03/02-collaboration-latency.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/02-collaboration-latency.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 4m30s max duration (incl. graceful stop):
              * collab_latency: Up to 30 looping VUs for 4m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   0% ] 01/30 VUs  0m00.9s/4m00.0s

running (0m02.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   1% ] 01/30 VUs  0m01.9s/4m00.0s

running (0m03.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   1% ] 01/30 VUs  0m02.9s/4m00.0s

running (0m04.0s), 02/30 VUs, 0 complete and 0 interrupted iterations
collab_latency   [   2% ] 02/30 VUs  0m03.9s/4m00.0s

running (0m05.0s), 02/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   2% ] 02/30 VUs  0m04.9s/4m00.0s

running (0m06.0s), 02/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   2% ] 02/30 VUs  0m05.9s/4m00.0s

running (0m07.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   3% ] 03/30 VUs  0m06.9s/4m00.0s

running (0m08.0s), 03/30 VUs, 1 complete and 0 interrupted iterations
collab_latency   [   3% ] 03/30 VUs  0m07.9s/4m00.0s

running (0m09.0s), 03/30 VUs, 2 complete and 0 interrupted iterations
collab_latency   [   4% ] 03/30 VUs  0m08.9s/4m00.0s

running (0m10.0s), 03/30 VUs, 3 complete and 0 interrupted iterations
collab_latency   [   4% ] 03/30 VUs  0m09.9s/4m00.0s

running (0m11.0s), 04/30 VUs, 3 complete and 0 interrupted iterations
collab_latency   [   5% ] 04/30 VUs  0m10.9s/4m00.0s

running (0m12.0s), 04/30 VUs, 4 complete and 0 interrupted iterations
collab_latency   [   5% ] 04/30 VUs  0m11.9s/4m00.0s

running (0m13.0s), 04/30 VUs, 4 complete and 0 interrupted iterations
collab_latency   [   5% ] 04/30 VUs  0m12.9s/4m00.0s

running (0m14.0s), 05/30 VUs, 4 complete and 0 interrupted iterations
collab_latency   [   6% ] 05/30 VUs  0m13.9s/4m00.0s

running (0m15.0s), 05/30 VUs, 5 complete and 0 interrupted iterations
collab_latency   [   6% ] 05/30 VUs  0m14.9s/4m00.0s

running (0m16.0s), 05/30 VUs, 6 complete and 0 interrupted iterations
collab_latency   [   7% ] 05/30 VUs  0m15.9s/4m00.0s

running (0m17.0s), 06/30 VUs, 7 complete and 0 interrupted iterations
collab_latency   [   7% ] 06/30 VUs  0m16.9s/4m00.0s

running (0m18.0s), 06/30 VUs, 8 complete and 0 interrupted iterations
collab_latency   [   7% ] 06/30 VUs  0m17.9s/4m00.0s

running (0m19.0s), 06/30 VUs, 10 complete and 0 interrupted iterations
collab_latency   [   8% ] 06/30 VUs  0m18.9s/4m00.0s

running (0m20.0s), 06/30 VUs, 12 complete and 0 interrupted iterations
collab_latency   [   8% ] 06/30 VUs  0m19.9s/4m00.0s

running (0m21.0s), 07/30 VUs, 14 complete and 0 interrupted iterations
collab_latency   [   9% ] 07/30 VUs  0m20.9s/4m00.0s

running (0m22.0s), 07/30 VUs, 15 complete and 0 interrupted iterations
collab_latency   [   9% ] 07/30 VUs  0m21.9s/4m00.0s

running (0m23.0s), 07/30 VUs, 16 complete and 0 interrupted iterations
collab_latency   [  10% ] 07/30 VUs  0m22.9s/4m00.0s

running (0m24.0s), 08/30 VUs, 17 complete and 0 interrupted iterations
collab_latency   [  10% ] 08/30 VUs  0m23.9s/4m00.0s

running (0m25.0s), 08/30 VUs, 19 complete and 0 interrupted iterations
collab_latency   [  10% ] 08/30 VUs  0m24.9s/4m00.0s

running (0m26.0s), 08/30 VUs, 22 complete and 0 interrupted iterations
collab_latency   [  11% ] 08/30 VUs  0m25.9s/4m00.0s

running (0m27.0s), 09/30 VUs, 23 complete and 0 interrupted iterations
collab_latency   [  11% ] 09/30 VUs  0m26.9s/4m00.0s

running (0m28.0s), 09/30 VUs, 25 complete and 0 interrupted iterations
collab_latency   [  12% ] 09/30 VUs  0m27.9s/4m00.0s

running (0m29.0s), 09/30 VUs, 26 complete and 0 interrupted iterations
collab_latency   [  12% ] 09/30 VUs  0m28.9s/4m00.0s

running (0m30.0s), 09/30 VUs, 30 complete and 0 interrupted iterations
collab_latency   [  12% ] 09/30 VUs  0m29.9s/4m00.0s

running (0m31.0s), 10/30 VUs, 30 complete and 0 interrupted iterations
collab_latency   [  13% ] 10/30 VUs  0m30.9s/4m00.0s

running (0m32.0s), 10/30 VUs, 34 complete and 0 interrupted iterations
collab_latency   [  13% ] 10/30 VUs  0m31.9s/4m00.0s

running (0m33.0s), 10/30 VUs, 36 complete and 0 interrupted iterations
collab_latency   [  14% ] 10/30 VUs  0m32.9s/4m00.0s

running (0m34.0s), 10/30 VUs, 37 complete and 0 interrupted iterations
collab_latency   [  14% ] 10/30 VUs  0m33.9s/4m00.0s

running (0m35.0s), 10/30 VUs, 38 complete and 0 interrupted iterations
collab_latency   [  15% ] 10/30 VUs  0m34.9s/4m00.0s

running (0m36.0s), 10/30 VUs, 38 complete and 0 interrupted iterations
collab_latency   [  15% ] 10/30 VUs  0m35.9s/4m00.0s

running (0m37.0s), 11/30 VUs, 38 complete and 0 interrupted iterations
collab_latency   [  15% ] 11/30 VUs  0m36.9s/4m00.0s

running (0m38.0s), 11/30 VUs, 40 complete and 0 interrupted iterations
collab_latency   [  16% ] 11/30 VUs  0m37.9s/4m00.0s

running (0m39.0s), 11/30 VUs, 42 complete and 0 interrupted iterations
collab_latency   [  16% ] 11/30 VUs  0m38.9s/4m00.0s

running (0m40.0s), 11/30 VUs, 43 complete and 0 interrupted iterations
collab_latency   [  17% ] 11/30 VUs  0m39.9s/4m00.0s

running (0m41.0s), 11/30 VUs, 45 complete and 0 interrupted iterations
collab_latency   [  17% ] 11/30 VUs  0m40.9s/4m00.0s

running (0m42.0s), 11/30 VUs, 47 complete and 0 interrupted iterations
collab_latency   [  17% ] 11/30 VUs  0m41.9s/4m00.0s

running (0m43.0s), 12/30 VUs, 48 complete and 0 interrupted iterations
collab_latency   [  18% ] 12/30 VUs  0m42.9s/4m00.0s

running (0m44.0s), 12/30 VUs, 51 complete and 0 interrupted iterations
collab_latency   [  18% ] 12/30 VUs  0m43.9s/4m00.0s

running (0m45.0s), 12/30 VUs, 52 complete and 0 interrupted iterations
collab_latency   [  19% ] 12/30 VUs  0m44.9s/4m00.0s

running (0m46.0s), 12/30 VUs, 57 complete and 0 interrupted iterations
collab_latency   [  19% ] 12/30 VUs  0m45.9s/4m00.0s

running (0m47.0s), 12/30 VUs, 57 complete and 0 interrupted iterations
collab_latency   [  20% ] 12/30 VUs  0m46.9s/4m00.0s

running (0m48.0s), 12/30 VUs, 59 complete and 0 interrupted iterations
collab_latency   [  20% ] 12/30 VUs  0m47.9s/4m00.0s

running (0m49.0s), 13/30 VUs, 59 complete and 0 interrupted iterations
collab_latency   [  20% ] 13/30 VUs  0m48.9s/4m00.0s

running (0m50.0s), 13/30 VUs, 62 complete and 0 interrupted iterations
collab_latency   [  21% ] 13/30 VUs  0m49.9s/4m00.0s

running (0m51.0s), 13/30 VUs, 65 complete and 0 interrupted iterations
collab_latency   [  21% ] 13/30 VUs  0m50.9s/4m00.0s

running (0m52.0s), 13/30 VUs, 66 complete and 0 interrupted iterations
collab_latency   [  22% ] 13/30 VUs  0m51.9s/4m00.0s

running (0m53.0s), 13/30 VUs, 69 complete and 0 interrupted iterations
collab_latency   [  22% ] 13/30 VUs  0m52.9s/4m00.0s

running (0m54.0s), 13/30 VUs, 72 complete and 0 interrupted iterations
collab_latency   [  22% ] 13/30 VUs  0m53.9s/4m00.0s

running (0m55.0s), 14/30 VUs, 75 complete and 0 interrupted iterations
collab_latency   [  23% ] 14/30 VUs  0m54.9s/4m00.0s

running (0m56.0s), 14/30 VUs, 76 complete and 0 interrupted iterations
collab_latency   [  23% ] 14/30 VUs  0m55.9s/4m00.0s

running (0m57.0s), 14/30 VUs, 79 complete and 0 interrupted iterations
collab_latency   [  24% ] 14/30 VUs  0m56.9s/4m00.0s

running (0m58.0s), 14/30 VUs, 79 complete and 0 interrupted iterations
collab_latency   [  24% ] 14/30 VUs  0m57.9s/4m00.0s

running (0m59.0s), 14/30 VUs, 84 complete and 0 interrupted iterations
collab_latency   [  25% ] 14/30 VUs  0m58.9s/4m00.0s

running (1m00.0s), 14/30 VUs, 85 complete and 0 interrupted iterations
collab_latency   [  25% ] 14/30 VUs  0m59.9s/4m00.0s

running (1m01.0s), 15/30 VUs, 89 complete and 0 interrupted iterations
collab_latency   [  25% ] 15/30 VUs  1m00.9s/4m00.0s

running (1m02.0s), 15/30 VUs, 90 complete and 0 interrupted iterations
collab_latency   [  26% ] 15/30 VUs  1m01.9s/4m00.0s

running (1m03.0s), 15/30 VUs, 92 complete and 0 interrupted iterations
collab_latency   [  26% ] 15/30 VUs  1m02.9s/4m00.0s

running (1m04.0s), 15/30 VUs, 96 complete and 0 interrupted iterations
collab_latency   [  27% ] 15/30 VUs  1m03.9s/4m00.0s

running (1m05.0s), 15/30 VUs, 97 complete and 0 interrupted iterations
collab_latency   [  27% ] 15/30 VUs  1m04.9s/4m00.0s

running (1m06.0s), 15/30 VUs, 100 complete and 0 interrupted iterations
collab_latency   [  27% ] 15/30 VUs  1m05.9s/4m00.0s

running (1m07.0s), 16/30 VUs, 100 complete and 0 interrupted iterations
collab_latency   [  28% ] 16/30 VUs  1m06.9s/4m00.0s

running (1m08.0s), 16/30 VUs, 105 complete and 0 interrupted iterations
collab_latency   [  28% ] 16/30 VUs  1m07.9s/4m00.0s

running (1m09.0s), 16/30 VUs, 105 complete and 0 interrupted iterations
collab_latency   [  29% ] 16/30 VUs  1m08.9s/4m00.0s

running (1m10.0s), 16/30 VUs, 108 complete and 0 interrupted iterations
collab_latency   [  29% ] 16/30 VUs  1m09.9s/4m00.0s

running (1m11.0s), 16/30 VUs, 108 complete and 0 interrupted iterations
collab_latency   [  30% ] 16/30 VUs  1m10.9s/4m00.0s

running (1m12.0s), 16/30 VUs, 111 complete and 0 interrupted iterations
collab_latency   [  30% ] 16/30 VUs  1m11.9s/4m00.0s

running (1m13.0s), 17/30 VUs, 111 complete and 0 interrupted iterations
collab_latency   [  30% ] 17/30 VUs  1m12.9s/4m00.0s

running (1m14.0s), 17/30 VUs, 116 complete and 0 interrupted iterations
collab_latency   [  31% ] 17/30 VUs  1m13.9s/4m00.0s

running (1m15.0s), 17/30 VUs, 118 complete and 0 interrupted iterations
collab_latency   [  31% ] 17/30 VUs  1m14.9s/4m00.0s

running (1m16.0s), 17/30 VUs, 120 complete and 0 interrupted iterations
collab_latency   [  32% ] 17/30 VUs  1m15.9s/4m00.0s

running (1m17.0s), 17/30 VUs, 125 complete and 0 interrupted iterations
collab_latency   [  32% ] 17/30 VUs  1m16.9s/4m00.0s

running (1m18.0s), 17/30 VUs, 128 complete and 0 interrupted iterations
collab_latency   [  32% ] 17/30 VUs  1m17.9s/4m00.0s

running (1m19.0s), 18/30 VUs, 128 complete and 0 interrupted iterations
collab_latency   [  33% ] 18/30 VUs  1m18.9s/4m00.0s

running (1m20.0s), 18/30 VUs, 130 complete and 0 interrupted iterations
collab_latency   [  33% ] 18/30 VUs  1m19.9s/4m00.0s

running (1m21.0s), 18/30 VUs, 134 complete and 0 interrupted iterations
collab_latency   [  34% ] 18/30 VUs  1m20.9s/4m00.0s

running (1m22.0s), 18/30 VUs, 135 complete and 0 interrupted iterations
collab_latency   [  34% ] 18/30 VUs  1m21.9s/4m00.0s

running (1m23.0s), 18/30 VUs, 138 complete and 0 interrupted iterations
collab_latency   [  35% ] 18/30 VUs  1m22.9s/4m00.0s

running (1m24.0s), 18/30 VUs, 139 complete and 0 interrupted iterations
collab_latency   [  35% ] 18/30 VUs  1m23.9s/4m00.0s

running (1m25.0s), 19/30 VUs, 142 complete and 0 interrupted iterations
collab_latency   [  35% ] 19/30 VUs  1m24.9s/4m00.0s

running (1m26.0s), 19/30 VUs, 143 complete and 0 interrupted iterations
collab_latency   [  36% ] 19/30 VUs  1m25.9s/4m00.0s

running (1m27.0s), 19/30 VUs, 150 complete and 0 interrupted iterations
collab_latency   [  36% ] 19/30 VUs  1m26.9s/4m00.0s

running (1m28.0s), 19/30 VUs, 150 complete and 0 interrupted iterations
collab_latency   [  37% ] 19/30 VUs  1m27.9s/4m00.0s

running (1m29.0s), 19/30 VUs, 150 complete and 0 interrupted iterations
collab_latency   [  37% ] 19/30 VUs  1m28.9s/4m00.0s

running (1m30.0s), 19/30 VUs, 156 complete and 0 interrupted iterations
collab_latency   [  37% ] 19/30 VUs  1m29.9s/4m00.0s

running (1m31.0s), 20/30 VUs, 156 complete and 0 interrupted iterations
collab_latency   [  38% ] 20/30 VUs  1m30.9s/4m00.0s

running (1m32.0s), 20/30 VUs, 156 complete and 0 interrupted iterations
collab_latency   [  38% ] 20/30 VUs  1m31.9s/4m00.0s

running (1m33.0s), 20/30 VUs, 160 complete and 0 interrupted iterations
collab_latency   [  39% ] 20/30 VUs  1m32.9s/4m00.0s

running (1m34.0s), 20/30 VUs, 161 complete and 0 interrupted iterations
collab_latency   [  39% ] 20/30 VUs  1m33.9s/4m00.0s

running (1m35.0s), 20/30 VUs, 165 complete and 0 interrupted iterations
collab_latency   [  40% ] 20/30 VUs  1m34.9s/4m00.0s

running (1m36.0s), 20/30 VUs, 165 complete and 0 interrupted iterations
collab_latency   [  40% ] 20/30 VUs  1m35.9s/4m00.0s

running (1m37.0s), 21/30 VUs, 167 complete and 0 interrupted iterations
collab_latency   [  40% ] 21/30 VUs  1m36.9s/4m00.0s

running (1m38.0s), 21/30 VUs, 173 complete and 0 interrupted iterations
collab_latency   [  41% ] 21/30 VUs  1m37.9s/4m00.0s

running (1m39.0s), 21/30 VUs, 173 complete and 0 interrupted iterations
collab_latency   [  41% ] 21/30 VUs  1m38.9s/4m00.0s

running (1m40.0s), 21/30 VUs, 173 complete and 0 interrupted iterations
collab_latency   [  42% ] 21/30 VUs  1m39.9s/4m00.0s

running (1m41.0s), 21/30 VUs, 174 complete and 0 interrupted iterations
collab_latency   [  42% ] 21/30 VUs  1m40.9s/4m00.0s

running (1m42.0s), 21/30 VUs, 176 complete and 0 interrupted iterations
collab_latency   [  42% ] 21/30 VUs  1m41.9s/4m00.0s

running (1m43.0s), 22/30 VUs, 176 complete and 0 interrupted iterations
collab_latency   [  43% ] 22/30 VUs  1m42.9s/4m00.0s

running (1m44.0s), 22/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  43% ] 22/30 VUs  1m43.9s/4m00.0s

running (1m45.0s), 22/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  44% ] 22/30 VUs  1m44.9s/4m00.0s

running (1m46.0s), 22/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  44% ] 22/30 VUs  1m45.9s/4m00.0s

running (1m47.0s), 22/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  45% ] 22/30 VUs  1m46.9s/4m00.0s

running (1m48.0s), 22/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  45% ] 22/30 VUs  1m47.9s/4m00.0s

running (1m49.0s), 23/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  45% ] 23/30 VUs  1m48.9s/4m00.0s

running (1m50.0s), 23/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  46% ] 23/30 VUs  1m49.9s/4m00.0s

running (1m51.0s), 23/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  46% ] 23/30 VUs  1m50.9s/4m00.0s

running (1m52.0s), 23/30 VUs, 179 complete and 0 interrupted iterations
collab_latency   [  47% ] 23/30 VUs  1m51.9s/4m00.0s

running (1m53.0s), 23/30 VUs, 188 complete and 0 interrupted iterations
collab_latency   [  47% ] 23/30 VUs  1m52.9s/4m00.0s

running (1m54.0s), 23/30 VUs, 188 complete and 0 interrupted iterations
collab_latency   [  47% ] 23/30 VUs  1m53.9s/4m00.0s

running (1m55.0s), 24/30 VUs, 188 complete and 0 interrupted iterations
collab_latency   [  48% ] 24/30 VUs  1m54.9s/4m00.0s

running (1m56.0s), 24/30 VUs, 193 complete and 0 interrupted iterations
collab_latency   [  48% ] 24/30 VUs  1m55.9s/4m00.0s

running (1m57.0s), 24/30 VUs, 197 complete and 0 interrupted iterations
collab_latency   [  49% ] 24/30 VUs  1m56.9s/4m00.0s

running (1m58.0s), 24/30 VUs, 197 complete and 0 interrupted iterations
collab_latency   [  49% ] 24/30 VUs  1m57.9s/4m00.0s

running (1m59.0s), 24/30 VUs, 198 complete and 0 interrupted iterations
collab_latency   [  50% ] 24/30 VUs  1m58.9s/4m00.0s

running (2m00.0s), 24/30 VUs, 198 complete and 0 interrupted iterations
collab_latency   [  50% ] 24/30 VUs  1m59.9s/4m00.0s

running (2m01.0s), 25/30 VUs, 205 complete and 0 interrupted iterations
collab_latency   [  50% ] 25/30 VUs  2m00.9s/4m00.0s

running (2m02.0s), 25/30 VUs, 208 complete and 0 interrupted iterations
collab_latency   [  51% ] 25/30 VUs  2m01.9s/4m00.0s

running (2m03.0s), 25/30 VUs, 208 complete and 0 interrupted iterations
collab_latency   [  51% ] 25/30 VUs  2m02.9s/4m00.0s

running (2m04.0s), 25/30 VUs, 209 complete and 0 interrupted iterations
collab_latency   [  52% ] 25/30 VUs  2m03.9s/4m00.0s

running (2m05.0s), 25/30 VUs, 215 complete and 0 interrupted iterations
collab_latency   [  52% ] 25/30 VUs  2m04.9s/4m00.0s

running (2m06.0s), 25/30 VUs, 215 complete and 0 interrupted iterations
collab_latency   [  52% ] 25/30 VUs  2m05.9s/4m00.0s

running (2m07.0s), 26/30 VUs, 215 complete and 0 interrupted iterations
collab_latency   [  53% ] 26/30 VUs  2m06.9s/4m00.0s

running (2m08.0s), 26/30 VUs, 215 complete and 0 interrupted iterations
collab_latency   [  53% ] 26/30 VUs  2m07.9s/4m00.0s

running (2m09.0s), 26/30 VUs, 215 complete and 0 interrupted iterations
collab_latency   [  54% ] 26/30 VUs  2m08.9s/4m00.0s

running (2m10.0s), 26/30 VUs, 215 complete and 0 interrupted iterations
collab_latency   [  54% ] 26/30 VUs  2m09.9s/4m00.0s

running (2m11.0s), 26/30 VUs, 217 complete and 0 interrupted iterations
collab_latency   [  55% ] 26/30 VUs  2m10.9s/4m00.0s

running (2m12.0s), 26/30 VUs, 217 complete and 0 interrupted iterations
collab_latency   [  55% ] 26/30 VUs  2m11.9s/4m00.0s

running (2m13.0s), 27/30 VUs, 227 complete and 0 interrupted iterations
collab_latency   [  55% ] 27/30 VUs  2m12.9s/4m00.0s

running (2m14.0s), 27/30 VUs, 227 complete and 0 interrupted iterations
collab_latency   [  56% ] 27/30 VUs  2m13.9s/4m00.0s

running (2m15.0s), 27/30 VUs, 227 complete and 0 interrupted iterations
collab_latency   [  56% ] 27/30 VUs  2m14.9s/4m00.0s

running (2m16.0s), 27/30 VUs, 232 complete and 0 interrupted iterations
collab_latency   [  57% ] 27/30 VUs  2m15.9s/4m00.0s

running (2m17.0s), 27/30 VUs, 236 complete and 0 interrupted iterations
collab_latency   [  57% ] 27/30 VUs  2m16.9s/4m00.0s

running (2m18.0s), 27/30 VUs, 236 complete and 0 interrupted iterations
collab_latency   [  57% ] 27/30 VUs  2m17.9s/4m00.0s

running (2m19.0s), 28/30 VUs, 237 complete and 0 interrupted iterations
collab_latency   [  58% ] 28/30 VUs  2m18.9s/4m00.0s

running (2m20.0s), 28/30 VUs, 244 complete and 0 interrupted iterations
collab_latency   [  58% ] 28/30 VUs  2m19.9s/4m00.0s

running (2m21.0s), 28/30 VUs, 244 complete and 0 interrupted iterations
collab_latency   [  59% ] 28/30 VUs  2m20.9s/4m00.0s

running (2m22.0s), 28/30 VUs, 246 complete and 0 interrupted iterations
collab_latency   [  59% ] 28/30 VUs  2m21.9s/4m00.0s

running (2m23.0s), 28/30 VUs, 247 complete and 0 interrupted iterations
collab_latency   [  60% ] 28/30 VUs  2m22.9s/4m00.0s

running (2m24.0s), 28/30 VUs, 247 complete and 0 interrupted iterations
collab_latency   [  60% ] 28/30 VUs  2m23.9s/4m00.0s

running (2m25.0s), 29/30 VUs, 256 complete and 0 interrupted iterations
collab_latency   [  60% ] 29/30 VUs  2m24.9s/4m00.0s

running (2m26.0s), 29/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  61% ] 29/30 VUs  2m25.9s/4m00.0s

running (2m27.0s), 29/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  61% ] 29/30 VUs  2m26.9s/4m00.0s

running (2m28.0s), 29/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  62% ] 29/30 VUs  2m27.9s/4m00.0s

running (2m29.0s), 29/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  62% ] 29/30 VUs  2m28.9s/4m00.0s

running (2m30.0s), 29/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  62% ] 29/30 VUs  2m29.9s/4m00.0s

running (2m31.0s), 30/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  63% ] 30/30 VUs  2m30.9s/4m00.0s

running (2m32.0s), 30/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  63% ] 30/30 VUs  2m31.9s/4m00.0s

running (2m33.0s), 30/30 VUs, 258 complete and 0 interrupted iterations
collab_latency   [  64% ] 30/30 VUs  2m32.9s/4m00.0s

running (2m34.0s), 30/30 VUs, 259 complete and 0 interrupted iterations
collab_latency   [  64% ] 30/30 VUs  2m33.9s/4m00.0s

running (2m35.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  65% ] 30/30 VUs  2m34.9s/4m00.0s

running (2m36.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  65% ] 30/30 VUs  2m35.9s/4m00.0s

running (2m37.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  65% ] 30/30 VUs  2m36.9s/4m00.0s

running (2m38.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  66% ] 30/30 VUs  2m37.9s/4m00.0s

running (2m39.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  66% ] 30/30 VUs  2m38.9s/4m00.0s

running (2m40.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  67% ] 30/30 VUs  2m39.9s/4m00.0s

running (2m41.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  67% ] 30/30 VUs  2m40.9s/4m00.0s

running (2m42.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  67% ] 30/30 VUs  2m41.9s/4m00.0s
time="2026-06-11T21:36:15Z" level=warning msg="Request Failed" error="Post \"http://localhost:30001/api/collab/49547349-39ef-49d3-9d6b-4c16839ebd4d/state\": request timeout"

running (2m43.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
collab_latency   [  68% ] 30/30 VUs  2m42.9s/4m00.0s

running (2m44.0s), 30/30 VUs, 271 complete and 0 interrupted iterations
collab_latency   [  68% ] 30/30 VUs  2m43.9s/4m00.0s

running (2m45.0s), 30/30 VUs, 271 complete and 0 interrupted iterations
collab_latency   [  69% ] 30/30 VUs  2m44.9s/4m00.0s

running (2m46.0s), 30/30 VUs, 271 complete and 0 interrupted iterations
collab_latency   [  69% ] 30/30 VUs  2m45.9s/4m00.0s

running (2m47.0s), 30/30 VUs, 271 complete and 0 interrupted iterations
collab_latency   [  70% ] 30/30 VUs  2m46.9s/4m00.0s

running (2m48.0s), 30/30 VUs, 271 complete and 0 interrupted iterations
collab_latency   [  70% ] 30/30 VUs  2m47.9s/4m00.0s

running (2m49.0s), 28/30 VUs, 282 complete and 0 interrupted iterations
collab_latency   [  70% ] 28/30 VUs  2m48.9s/4m00.0s

running (2m50.0s), 28/30 VUs, 282 complete and 0 interrupted iterations
collab_latency   [  71% ] 28/30 VUs  2m49.9s/4m00.0s

running (2m51.0s), 28/30 VUs, 282 complete and 0 interrupted iterations
collab_latency   [  71% ] 28/30 VUs  2m50.9s/4m00.0s

running (2m52.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  72% ] 28/30 VUs  2m51.9s/4m00.0s

running (2m53.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  72% ] 28/30 VUs  2m52.9s/4m00.0s

running (2m54.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  72% ] 28/30 VUs  2m53.9s/4m00.0s

running (2m55.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  73% ] 28/30 VUs  2m54.9s/4m00.0s

running (2m56.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  73% ] 28/30 VUs  2m55.9s/4m00.0s

running (2m57.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  74% ] 28/30 VUs  2m56.9s/4m00.0s

running (2m58.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  74% ] 28/30 VUs  2m57.9s/4m00.0s

running (2m59.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  75% ] 28/30 VUs  2m58.9s/4m00.0s
time="2026-06-11T21:36:32Z" level=warning msg="Request Failed" error="Post \"http://localhost:30001/api/collab/6bbf0966-ee95-4399-a46a-732c7e5f69c6/state\": request timeout"

running (3m00.0s), 28/30 VUs, 284 complete and 0 interrupted iterations
collab_latency   [  75% ] 28/30 VUs  2m59.9s/4m00.0s

running (3m01.0s), 28/30 VUs, 285 complete and 0 interrupted iterations
collab_latency   [  75% ] 28/30 VUs  3m00.9s/4m00.0s

running (3m02.0s), 28/30 VUs, 292 complete and 0 interrupted iterations
collab_latency   [  76% ] 28/30 VUs  3m01.9s/4m00.0s

running (3m03.0s), 28/30 VUs, 292 complete and 0 interrupted iterations
collab_latency   [  76% ] 28/30 VUs  3m02.9s/4m00.0s

running (3m04.0s), 27/30 VUs, 294 complete and 0 interrupted iterations
collab_latency   [  77% ] 27/30 VUs  3m03.9s/4m00.0s

running (3m05.0s), 26/30 VUs, 295 complete and 1 interrupted iterations
collab_latency   [  77% ] 26/30 VUs  3m04.9s/4m00.0s

running (3m06.0s), 26/30 VUs, 303 complete and 1 interrupted iterations
collab_latency   [  77% ] 26/30 VUs  3m05.9s/4m00.0s

running (3m07.0s), 26/30 VUs, 304 complete and 1 interrupted iterations
collab_latency   [  78% ] 26/30 VUs  3m06.9s/4m00.0s

running (3m08.0s), 25/30 VUs, 306 complete and 1 interrupted iterations
collab_latency   [  78% ] 25/30 VUs  3m07.9s/4m00.0s

running (3m09.0s), 25/30 VUs, 313 complete and 1 interrupted iterations
collab_latency   [  79% ] 25/30 VUs  3m08.9s/4m00.0s
time="2026-06-11T21:36:42Z" level=warning msg="Request Failed" error="Post \"http://localhost:30001/api/collab/63d489f2-d90e-4097-8128-7a9cf3a40bb9/state\": request timeout"

running (3m10.0s), 25/30 VUs, 313 complete and 1 interrupted iterations
collab_latency   [  79% ] 25/30 VUs  3m09.9s/4m00.0s

running (3m11.0s), 25/30 VUs, 314 complete and 1 interrupted iterations
collab_latency   [  80% ] 25/30 VUs  3m10.9s/4m00.0s

running (3m12.0s), 25/30 VUs, 314 complete and 1 interrupted iterations
collab_latency   [  80% ] 25/30 VUs  3m11.9s/4m00.0s

running (3m13.0s), 25/30 VUs, 314 complete and 1 interrupted iterations
collab_latency   [  80% ] 25/30 VUs  3m12.9s/4m00.0s

running (3m14.0s), 25/30 VUs, 314 complete and 1 interrupted iterations
collab_latency   [  81% ] 25/30 VUs  3m13.9s/4m00.0s

running (3m15.0s), 25/30 VUs, 314 complete and 1 interrupted iterations
collab_latency   [  81% ] 25/30 VUs  3m14.9s/4m00.0s

running (3m16.0s), 25/30 VUs, 314 complete and 1 interrupted iterations
collab_latency   [  82% ] 25/30 VUs  3m15.9s/4m00.0s

running (3m17.0s), 24/30 VUs, 315 complete and 2 interrupted iterations
collab_latency   [  82% ] 24/30 VUs  3m16.9s/4m00.0s

running (3m18.0s), 23/30 VUs, 324 complete and 2 interrupted iterations
collab_latency   [  82% ] 23/30 VUs  3m17.9s/4m00.0s

running (3m19.0s), 23/30 VUs, 324 complete and 2 interrupted iterations
collab_latency   [  83% ] 23/30 VUs  3m18.9s/4m00.0s

running (3m20.0s), 23/30 VUs, 324 complete and 2 interrupted iterations
collab_latency   [  83% ] 23/30 VUs  3m19.9s/4m00.0s

running (3m21.0s), 22/30 VUs, 332 complete and 2 interrupted iterations
collab_latency   [  84% ] 22/30 VUs  3m20.9s/4m00.0s

running (3m22.0s), 22/30 VUs, 333 complete and 2 interrupted iterations
collab_latency   [  84% ] 22/30 VUs  3m21.9s/4m00.0s

running (3m23.0s), 22/30 VUs, 334 complete and 2 interrupted iterations
collab_latency   [  85% ] 22/30 VUs  3m22.9s/4m00.0s

running (3m24.0s), 22/30 VUs, 334 complete and 2 interrupted iterations
collab_latency   [  85% ] 22/30 VUs  3m23.9s/4m00.0s

running (3m25.0s), 20/30 VUs, 338 complete and 3 interrupted iterations
collab_latency   [  85% ] 20/30 VUs  3m24.9s/4m00.0s
time="2026-06-11T21:36:58Z" level=warning msg="Request Failed" error="Post \"http://localhost:30001/api/collab/0baf1a33-868d-4493-8aef-cea184d3d874/state\": request timeout"

running (3m26.0s), 20/30 VUs, 338 complete and 3 interrupted iterations
collab_latency   [  86% ] 20/30 VUs  3m25.9s/4m00.0s

running (3m27.0s), 20/30 VUs, 339 complete and 3 interrupted iterations
collab_latency   [  86% ] 20/30 VUs  3m26.9s/4m00.0s

running (3m28.0s), 20/30 VUs, 340 complete and 3 interrupted iterations
collab_latency   [  87% ] 20/30 VUs  3m27.9s/4m00.0s

running (3m29.0s), 20/30 VUs, 345 complete and 3 interrupted iterations
collab_latency   [  87% ] 20/30 VUs  3m28.9s/4m00.0s

running (3m30.0s), 19/30 VUs, 348 complete and 3 interrupted iterations
collab_latency   [  87% ] 19/30 VUs  3m29.9s/4m00.0s

running (3m31.0s), 19/30 VUs, 348 complete and 3 interrupted iterations
collab_latency   [  88% ] 19/30 VUs  3m30.9s/4m00.0s

running (3m32.0s), 19/30 VUs, 352 complete and 3 interrupted iterations
collab_latency   [  88% ] 19/30 VUs  3m31.9s/4m00.0s

running (3m33.0s), 19/30 VUs, 352 complete and 3 interrupted iterations
collab_latency   [  89% ] 19/30 VUs  3m32.9s/4m00.0s
time="2026-06-11T21:37:06Z" level=warning msg="Request Failed" error="Post \"http://localhost:30001/api/collab/c5550494-f533-4c63-a860-b164dbad73cd/state\": request timeout"

running (3m34.0s), 19/30 VUs, 352 complete and 3 interrupted iterations
collab_latency   [  89% ] 19/30 VUs  3m33.9s/4m00.0s

running (3m35.0s), 19/30 VUs, 353 complete and 3 interrupted iterations
collab_latency   [  90% ] 19/30 VUs  3m34.9s/4m00.0s

running (3m36.0s), 19/30 VUs, 353 complete and 3 interrupted iterations
collab_latency   [  90% ] 19/30 VUs  3m35.9s/4m00.0s

running (3m37.0s), 19/30 VUs, 353 complete and 3 interrupted iterations
collab_latency   [  90% ] 19/30 VUs  3m36.9s/4m00.0s

running (3m38.0s), 19/30 VUs, 354 complete and 3 interrupted iterations
collab_latency   [  91% ] 19/30 VUs  3m37.9s/4m00.0s

running (3m39.0s), 19/30 VUs, 354 complete and 3 interrupted iterations
collab_latency   [  91% ] 19/30 VUs  3m38.9s/4m00.0s

running (3m40.0s), 18/30 VUs, 360 complete and 3 interrupted iterations
collab_latency   [  92% ] 18/30 VUs  3m39.9s/4m00.0s

running (3m41.0s), 18/30 VUs, 360 complete and 3 interrupted iterations
collab_latency   [  92% ] 18/30 VUs  3m40.9s/4m00.0s

running (3m42.0s), 18/30 VUs, 363 complete and 3 interrupted iterations
collab_latency   [  92% ] 18/30 VUs  3m41.9s/4m00.0s

running (3m43.0s), 17/30 VUs, 365 complete and 3 interrupted iterations
collab_latency   [  93% ] 17/30 VUs  3m42.9s/4m00.0s

running (3m44.0s), 17/30 VUs, 365 complete and 3 interrupted iterations
collab_latency   [  93% ] 17/30 VUs  3m43.9s/4m00.0s

running (3m45.0s), 15/30 VUs, 369 complete and 4 interrupted iterations
collab_latency   [  94% ] 15/30 VUs  3m44.9s/4m00.0s

running (3m46.0s), 14/30 VUs, 371 complete and 4 interrupted iterations
collab_latency   [  94% ] 14/30 VUs  3m45.9s/4m00.0s

running (3m47.0s), 14/30 VUs, 371 complete and 4 interrupted iterations
collab_latency   [  95% ] 14/30 VUs  3m46.9s/4m00.0s

running (3m48.0s), 12/30 VUs, 375 complete and 4 interrupted iterations
collab_latency   [  95% ] 12/30 VUs  3m47.9s/4m00.0s

running (3m49.0s), 12/30 VUs, 375 complete and 4 interrupted iterations
collab_latency   [  95% ] 12/30 VUs  3m48.9s/4m00.0s

running (3m50.0s), 12/30 VUs, 375 complete and 4 interrupted iterations
collab_latency   [  96% ] 12/30 VUs  3m49.9s/4m00.0s

running (3m51.0s), 12/30 VUs, 375 complete and 4 interrupted iterations
collab_latency   [  96% ] 12/30 VUs  3m50.9s/4m00.0s

running (3m52.0s), 12/30 VUs, 375 complete and 4 interrupted iterations
collab_latency   [  97% ] 12/30 VUs  3m51.9s/4m00.0s

running (3m53.0s), 12/30 VUs, 376 complete and 4 interrupted iterations
collab_latency   [  97% ] 12/30 VUs  3m52.9s/4m00.0s

running (3m54.0s), 12/30 VUs, 376 complete and 4 interrupted iterations
collab_latency   [  97% ] 12/30 VUs  3m53.9s/4m00.0s

running (3m55.0s), 12/30 VUs, 377 complete and 4 interrupted iterations
collab_latency   [  98% ] 12/30 VUs  3m54.9s/4m00.0s

running (3m56.0s), 12/30 VUs, 377 complete and 4 interrupted iterations
collab_latency   [  98% ] 12/30 VUs  3m55.9s/4m00.0s

running (3m57.0s), 12/30 VUs, 378 complete and 4 interrupted iterations
collab_latency   [  99% ] 12/30 VUs  3m56.9s/4m00.0s

running (3m58.0s), 12/30 VUs, 378 complete and 4 interrupted iterations
collab_latency   [  99% ] 12/30 VUs  3m57.9s/4m00.0s

running (3m59.0s), 11/30 VUs, 380 complete and 4 interrupted iterations
collab_latency   [ 100% ] 11/30 VUs  3m58.9s/4m00.0s

running (4m00.0s), 10/30 VUs, 382 complete and 4 interrupted iterations
collab_latency   [ 100% ] 10/30 VUs  3m59.9s/4m00.0s

running (4m01.0s), 08/30 VUs, 383 complete and 5 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m02.0s), 07/30 VUs, 384 complete and 5 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m03.0s), 06/30 VUs, 384 complete and 6 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m04.0s), 06/30 VUs, 384 complete and 6 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m05.0s), 05/30 VUs, 384 complete and 7 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m06.0s), 04/30 VUs, 385 complete and 7 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m07.0s), 03/30 VUs, 385 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m08.0s), 03/30 VUs, 385 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m09.0s), 03/30 VUs, 385 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m10.0s), 03/30 VUs, 385 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m11.0s), 03/30 VUs, 385 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m12.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m13.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m14.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m15.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m16.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m17.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m18.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m19.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m20.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m21.0s), 02/30 VUs, 386 complete and 8 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m22.0s), 01/30 VUs, 386 complete and 9 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m23.0s), 01/30 VUs, 386 complete and 9 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m24.0s), 01/30 VUs, 386 complete and 9 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

running (4m25.0s), 01/30 VUs, 386 complete and 9 interrupted iterations
collab_latency ↓ [ 100% ] 10/30 VUs  4m0s

     █ collab_Geospatial

       ✓ Geospatial guest sees host state

     █ collab_MonteCarlo

       ✓ MonteCarlo guest sees host state

     █ collab_ClimateAnomaly

       ✗ ClimateAnomaly guest sees host state
        ↳  0% — ✓ 0 / ✗ 55

     █ collab_Analytics

       ✓ Analytics guest sees host state

     █ collab_Advanced

       ✓ Advanced guest sees host state

     █ collab_DataExchange

       ✓ DataExchange guest sees host state

     █ collab_Calculator

       ✓ Calculator guest sees host state

     █ collab_MLTrainer

       ✓ MLTrainer guest sees host state

     checks.........................: 85.52% 325 out of 380
     collab_host_post_ms............: avg=4.16s    min=6ms      med=94.5ms  max=1m0s     p(90)=12.82s   p(95)=36.77s  
   ✗ collab_propagation_ms..........: avg=3.63s    min=1ms      med=35.5ms  max=52.75s   p(90)=12.09s   p(95)=28.63s  
     collab_success.................: 325    1.222623/s
     collab_timeout.................: 61     0.229477/s
     data_received..................: 3.6 MB 14 kB/s
     data_sent......................: 1.5 MB 5.5 kB/s
     group_duration.................: avg=9.88s    min=196.99ms med=2.55s   max=1m7s     p(90)=32.4s    p(95)=50.46s  
     http_req_blocked...............: avg=10µs     min=1.7µs    med=6.11µs  max=728.34µs p(90)=9.38µs   p(95)=11.32µs 
     http_req_connecting............: avg=2.33µs   min=0s       med=0s      max=415.51µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=736.58ms min=1.61ms   med=87.04ms max=1m0s     p(90)=745.07ms p(95)=1.15s   
       { expected_response:true }...: avg=658.24ms min=1.61ms   med=86.61ms max=59.35s   p(90)=740.92ms p(95)=1.12s   
   ✓ http_req_failed................: 0.13%  6 out of 4545
     http_req_receiving.............: avg=155.32µs min=0s       med=89.94µs max=43.34ms  p(90)=163.56µs p(95)=203.69µs
     http_req_sending...............: avg=30.08µs  min=5.21µs   med=26.87µs max=502.83µs p(90)=45.57µs  p(95)=55.58µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=736.4ms  min=1.56ms   med=86.87ms max=1m0s     p(90)=744.98ms p(95)=1.15s   
     http_reqs......................: 4545   17.097909/s
     iteration_duration.............: avg=10.88s   min=1.19s    med=3.55s   max=1m8s     p(90)=33.4s    p(95)=51.46s  
     iterations.....................: 386    1.4521/s
     vus............................: 1      min=1          max=30
     vus_max........................: 30     min=30         max=30


running (4m25.8s), 00/30 VUs, 386 complete and 10 interrupted iterations
collab_latency ✓ [ 100% ] 00/30 VUs  4m0s
time="2026-06-11T21:37:58Z" level=error msg="thresholds on metrics 'collab_propagation_ms' have been crossed"